#### ExternalServiceResult Enumeration

---

|  |
| --- |
| See Also |

An enumerated value representing a result from executing an external service.

**Namespace:**   Autodesk.Revit.DB.ExternalService
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum ExternalServiceResult ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration ExternalServiceResult ``` |

| Visual C++ |
| --- |
| ``` public enum class ExternalServiceResult ``` |

# Members

| Member name | Description |
| --- | --- |
| Succeeded | Service has been executed successfully. |
| Failed | Service execution has failed. |
| Unhandled | Execution of a service has not been handled; possibly because there are no applicable servers. |

# See Also

Autodesk.Revit.DB.ExternalService Namespace